amazons3-connector-test/src/resources/artifacts/ESB/config/soapRequests/amazons3/createObject.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.amazons3.putObject">
   <soapenv:Header/>
   <soapenv:Body>
   <urn:accessKeyId>AKIAIGURZM7GJ7TRO6KQ</urn:accessKeyId>
 <urn:secretAccessKey>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</urn:secretAccessKey>
  <urn:methodType>PUT</urn:methodType>
<urn:contentType>application/xml</urn:contentType>
<urn:bucketName>imagesBucket5</urn:bucketName>
<urn:xAmzDate>true</urn:xAmzDate>
<urn:xAmzSecurityToken></urn:xAmzSecurityToken>
<urn:contentMD5></urn:contentMD5>
 <urn:bucketUrl>http://s3.amazonaws.com/imagesBucket5</urn:bucketUrl>
<urn:uriRemainder>/testObject51</urn:uriRemainder>
 <urn:host>s3.amazonaws.com</urn:host>
<urn:expect></urn:expect>


<urn:xAmzAcl></urn:xAmzAcl>
<urn:xAmzGrantRead></urn:xAmzGrantRead>
<urn:xAmzGrantWrite></urn:xAmzGrantWrite>
 <urn:xAmzGrantReadAcp></urn:xAmzGrantReadAcp>
<urn:xAmzGrantWriteAcp></urn:xAmzGrantWriteAcp>
<urn:xAmzGrantFullControl></urn:xAmzGrantFullControl>

<urn:contentDisposition></urn:contentDisposition>
<urn:contentEncoding></urn:contentEncoding>
<urn:contentLength></urn:contentLength>
<urn:expires></urn:expires>
<urn:xAmzMeta>Content-Language:enus</urn:xAmzMeta>
<urn:xAmzServeEncryption>AES256</urn:xAmzServeEncryption>
<urn:xAmzStorageClass>STANDARD</urn:xAmzStorageClass>
<urn:xAmzWebsiteLocation></urn:xAmzWebsiteLocation>
   </soapenv:Body>
</soapenv:Envelope>
